{"word":"voracious","senses":[{"id":"m_en_gbus1135450.005","definitions":["wanting or devouring great quantities of food"],"usages":[{"text":"a voracious appetite"}],"sentence":"One more tragedy caused by the voracious appetites of men determined to consume all the diminishing resources of fish left in the seas."},{"id":"m_en_gbus1135450.007","definitions":["engaging in an activity with great eagerness or enthusiasm"],"usages":[{"text":"she's a voracious reader"}],"sentence":"He has a voracious appetite for film study, takes detailed notes in meetings and does plenty of technique work on his own."}]}
{"word":"beatific","senses":[{"id":"m_en_gbus0081280.006","definitions":["feeling or expressing blissful happiness"],"usages":[{"text":"a beatific smile"}],"sentence":"With a beatific smile, Weldon rose above the ensuing stushie and laughed all the way to the bank, proving once again that diamonds are a girl's best friend."}]}
{"word":"embargo","senses":[{"id":"m_en_gbus0319510.007","definitions":["an official ban on trade or other commercial activity with a particular country"],"usages":[{"text":"an embargo on grain sales"},{"text":"an arms embargo"}]},{"id":"m_en_gbus0319510.013","definitions":["an order of a state forbidding foreign ships to enter, or any ships to leave, its ports"],"usages":[{"text":"an embargo laid by our Emperor upon all vessels whatsoever"}]},{"id":"m_en_gbus0319510.011","definitions":["an official ban on any activity"],"usages":[{"text":"there is a complete embargo on taking photographs in court"}]}]}
{"word":"gloze","senses":[{"id":"m_en_gbus0418140.007","definitions":["make excuses for"],"usages":[{"text":"the demeanour of Mathews is rather glozed over"}],"sentence":"It does, however, seem probable that Luke has to some extent glozed over the asperity of the controversies within the Church, notably the opposition to Paul and his views as described by Paul himself in Galatians and II Corinthians, in his attempt to emphasise the fundamental unity of the early Church."},{"id":"m_en_gbus0418140.014","definitions":["use ingratiating language"],"usages":[{"text":"we would not that thou shouldst learn too early how men's tongues can gloze and flatter"}]},{"id":"m_en_gbus0418140.016","definitions":["make a comment or comments"],"usages":[{"text":"tomes of reasoned wrong, glozed on by ignorance"}]}]}
{"word":"felicitous","senses":[{"id":"m_en_gbus0355600.005","definitions":["well chosen or suited to the circumstances"],"usages":[{"text":"a felicitous phrase"}],"sentence":"To adapt Benedict Anderson's felicitous phrase, hockey is one cultural activity through which Canadians are often said to imagine their community."},{"id":"m_en_gbus0355600.007","definitions":["pleasing and fortunate"],"usages":[{"text":"the view was the room's only felicitous feature"}],"sentence":"A felicitous mix of fun and entertainment it was."}]}
{"word":"myrmidon","senses":[{"id":"m_en_gbus0674800.007","definitions":["a follower or subordinate of a powerful person, typically one who is unscrupulous or carries out orders unquestioningly"],"usages":[{"text":"one of Hitler's myrmidons"}],"sentence":"Sixteen metres below the raging battle, Hitler and his myrmidons were ensconced in a bunker that lacked the facilities to track enemy movements."}]}
{"word":"chapel","senses":[{"id":"m_en_gbus0169210.006","definitions":["a small building or room used for Christian worship in a school, prison, hospital, or large private house"],"usages":[{"text":"a service in the chapel"}],"sentence":"This does confirm the traditional picture of the parish church as the church of the poor, in contrast with the private chapels that were the typical churches of the wealthy."},{"id":"m_en_gbus0169210.015","definitions":["the members or branch of a print or newspaper trade union at a particular place of work"],"usages":[{"text":"Mr Brind was the head of the BBC's NUJ chapel"}],"sentence":"Lucie McFall is a Bolton Evening News reporter and joint mother of the chapel."},{"id":"m_en_gbus0169210.010","definitions":["a part of a large church or cathedral with its own altar and dedication"],"usages":[{"text":"the first chapel on the right of the cathedral is dedicated to St Ludmila"}],"sentence":"Nothing is known about him; he was clearly familiar with Franco-Flemish painting, but his main debt is to the earlier court school in Bohemia, at Karltejn and in the chapels of the cathedral in Prague."},{"id":"m_en_gbus0169210.011","definitions":["a place of worship for Nonconformist congregations"],"usages":[{"text":"she went to chapel twice on Sunday"}],"sentence":"That is the reason why the temperance movement had support not only in the chapels but in the Chartist movement and later trade unions."},{"id":"m_en_gbus0169210.012","definitions":["a small building or room used for funeral services"],"usages":[{"text":"the funeral was in the chapel at Broadfoot Brothers Funeral Home"}],"sentence":"I have planned both a full Catholic mass, and a smaller, personal service in a funeral home chapel."}]}
{"word":"magnanimous","senses":[{"id":"m_en_gbus0607130.005","definitions":["generous or forgiving, especially towards a rival or less powerful person"],"usages":[{"text":"she should be magnanimous in victory"}],"sentence":"It was his first domestic reverse as Celtic manager, and a painful one, but he was calm and magnanimous as he congratulated Rangers that afternoon."}]}
{"word":"amicable","senses":[{"id":"m_en_gbus0028580.005","definitions":["characterized by friendliness and absence of discord"],"usages":[{"text":"the meeting was relatively amicable"},{"text":"an amicable settlement of the dispute"}],"sentence":"He recently admitted the trio regularly congratulate themselves on having such an amicable relationship."}]}
{"word":"suborn","senses":[{"id":"m_en_gbus1007800.007","definitions":["bribe or otherwise induce (someone) to commit an unlawful act such as perjury"],"usages":[{"text":"he was accused of conspiring to suborn witnesses"}],"sentence":"And I said, the congressman himself who knows this thing is false, is asking you to suborn perjury?"}]}
{"word":"doldrums","senses":[{"id":"m_en_gbus0288870.008","definitions":["a state or period of stagnation or depression"],"usages":[{"text":"the mortgage market has been in the doldrums for three years"}],"sentence":"If you have a room that's suffering from the doldrums, a bit of tomato - paired with bright yellow, or with white stripes - will be sure add a jolt of energy."},{"id":"m_en_gbus0288870.011","definitions":["an equatorial region of the Atlantic Ocean with calms, sudden storms, and light unpredictable winds"],"usages":[{"text":"Hurricane Verity had been born in the doldrums"}],"sentence":"The trade winds from both hemispheres converge towards the doldrums and a zone of low pressure, the equatorial trough, that girdles the earth."}]}
{"word":"incoherent","senses":[{"id":"m_en_gbus0501880.007","definitions":["(of spoken or written language) expressed in an incomprehensible or confusing way; unclear"],"usages":[{"text":"he screamed some incoherent threat"}],"sentence":"I'm very grateful that these incoherent ramblings find some resonance out there - we can all do with some validation can't we?"},{"id":"m_en_gbus0501880.009","definitions":["(of a person) unable to speak intelligibly"],"usages":[{"text":"he was incoherent with sentiment"}],"sentence":"She's incoherent, crying, sobbing, and there is not a person in the room who doesn't know that it is all an act."},{"id":"m_en_gbus0501880.010","definitions":["not logical or internally consistent"],"usages":[{"text":"the film is ideologically incoherent"}],"sentence":"The thought that the process theory is logically incoherent comes from two sources."}]}
{"word":"interdigitate","senses":[{"id":"m_en_gbus0515530.005","definitions":["(of two or more things) interlock like the fingers of two clasped hands"],"usages":[{"text":"the scales at the shell margins of opposing valves frequently interdigitate"}],"sentence":"They are supposed to be in two rows, which we call biseriate; however, it often is difficult to see a line of separation because of the way they interdigitate."}]}
{"word":"noetic","senses":[{"id":"m_en_gbus0694530.005","definitions":["relating to mental activity or the intellect"],"usages":[{"text":"the noetic quality of a mystical experience refers to the sense of revelation"}],"sentence":"They say that one could be rational in accepting a noetic system that has atheism as its foundational presupposition, since there is no good objective evidence for God's existence."}]}
{"word":"colubrine","senses":[{"id":"m_en_gbus0201420.005","definitions":["relating to or resembling a snake"],"usages":[{"text":"he had played a game of subtle, colubrine misdirection"}],"sentence":"This finding suggested that it was recruited into the chemical arsenal of snakes before the split between the elapid and colubrine lineages."}]}
{"word":"refurbish","senses":[{"id":"m_en_gbus0856970.003","definitions":["renovate and redecorate (something, especially a building)"],"usages":[{"text":"the premises have been completely refurbished in our corporate style"}],"sentence":"When he saw the state of the orphanage he vowed to return with enough funding to rebuild it and refurbish the facilities inside."}]}
{"word":"martinet","senses":[{"id":"m_en_gbus0620810.005","definitions":["a person who demands complete obedience; a strict disciplinarian"],"usages":[{"text":"the woman in charge was a martinet who treated all those beneath her like children"},{"text":"a martinet of a staff officer"}],"sentence":"The man naturally looks a bit crestfallen and the secretary, letting down his martinet's mask for the moment, gestures with his head to an elderly gent, sitting nearby in a large leather upholstered chair, his head buried in the Times."}]}
{"word":"collude","senses":[{"id":"m_en_gbus0200260.005","definitions":["cooperate in a secret or unlawful way in order to deceive or gain an advantage over others"],"usages":[{"text":"the president accused his opponents of colluding with foreigners"},{"text":"certain officials were colluding in the avoidance of drugs tests"}],"sentence":"Assorted deadbeats such as myself are apparently colluding in a conspiracy of silence about parenthood."}]}
{"word":"coeval","senses":[{"id":"m_en_gbus0196980.005","definitions":["having the same age or date of origin; contemporary"],"usages":[{"text":"these lavas were coeval with the volcanic activity"}]}]}
